app/controllers/food_items_controller.rb

  def show
    @food_item = FoodItem.find(params[:id])
---
SELECT "food_items".* FROM "food_items" WHERE "food_items"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @food_item = FoodItem.new(food_item_params)
    if @food_item.save
---
INSERT INTO "food_items" ("created_at", "description", "quantity", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 24 Sep 2013 02:19:30 UTC +00:00], ["description", "So Creamy Good"], ["quantity", 90], ["title", "Guac"], ["updated_at", Tue, 24 Sep 2013 02:19:30 UTC +00:00]]